In [3]:
import numpy as np
import pandas as pd

In [4]:
labels = ['a','b','c']
mylist = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [9]:
pd.Series(data=mylist , index=labels) #yek serie dorost mikone k 2 rah baraye entekhab dar
#ya az tarigh index 0 ya az tarigh a

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(arr,labels) #mishe data o index ro dg nazarim

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(d)#faghat shamele data o index

a    10
b    20
c    30
dtype: int64

In [12]:
salesQ1 = pd.Series(data=[250,450,200,150],index=['USA','China','India','Brazil'])

In [13]:
salesQ2 = pd.Series(data=[260,500,210,100],index=['USA','China','India','Japan'])

In [14]:
salesQ2['USA'] #mishe mesle dictionary az pandas estefade kard

260

In [15]:
salesQ2[0]

260

In [16]:
salesQ1+salesQ2 #NAN yanni tu yki az data ha bude faghat

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

In [17]:
columns = ['w','x','y','z']
index = ['a','b','c','d','e']

In [18]:
from numpy.random import randint

In [19]:
np.random.seed(42)
data = randint(-100,100,(5,4))
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [20]:
df = pd.DataFrame(data,index,columns)
df #mesle pd.series ama be jash columns ham dare

    w   x   y   z
a   2  79  -8 -86
b   6 -29  88 -80
c   2  21 -26 -13
d  16  -1   3  51
e  30  49 -48 -99

In [21]:
df['z','w']#2ta [] darim chon mikhaym ye list begirim

KeyError: ('z', 'w')

In [46]:
df['new'] = df['w'] +df['y']
df

    w   x   y   z  new
a   2  79  -8 -86   -6
b   6 -29  88 -80   94
c   2  21 -26 -13  -24
d  16  -1   3  51   19
e  30  49 -48 -99  -18

In [47]:
df = df.drop('new',axis=1) #drop hazf mikone
#un yek be khatere axis hastesh k defaultesh ruye row hast
#vaghti migim axis = 1 yani tu column negah kon
df

    w   x   y   z
a   2  79  -8 -86
b   6 -29  88 -80
c   2  21 -26 -13
d  16  -1   3  51
e  30  49 -48 -99

In [49]:
df.loc[['a','e']] #loc mige k donbale row hastam

    w   x   y   z
a   2  79  -8 -86
e  30  49 -48 -99

In [53]:
df.iloc[0:3] #donbal migarde ama bar asase index integer

   w   x   y   z
a  2  79  -8 -86
b  6 -29  88 -80
c  2  21 -26 -13

In [54]:
df.drop('c') #chon default row hastesh niyaz be entekhab axis nist

    w   x   y   z
a   2  79  -8 -86
b   6 -29  88 -80
d  16  -1   3  51
e  30  49 -48 -99

In [58]:
df.loc[['a','c'],['w','y']] #migarde donbale row o column ham zaman

   w   y
a  2  -8
c  2 -26

In [59]:
df > 0 #ye moghayese anjam mide

      w      x      y      z
a  True   True  False  False
b  True  False   True  False
c  True   True  False  False
d  True  False   True   True
e  True   True  False  False

In [65]:
df[df>0]#yek filter mikone

    w     x     y     z
a   2  79.0   NaN   NaN
b   6   NaN  88.0   NaN
c   2  21.0   NaN   NaN
d  16   NaN   3.0  51.0
e  30  49.0   NaN   NaN

In [68]:
df[df['x']>0] #ye filter mizarim

    w   x   y   z
a   2  79  -8 -86
c   2  21 -26 -13
e  30  49 -48 -99

In [69]:
df[df['x']>0].iloc[0] # ye filter dg k faghat radife aval ro bede

w     2
x    79
y    -8
z   -86
Name: a, dtype: int64

In [70]:
(df['w']>0 ) & (df['y']>1) #tarkibe 2 shart

a    False
b     True
c    False
d     True
e    False
dtype: bool

In [71]:
(df['w']>0 ) | (df['y']>1) #har kodum az 2 shart dorost bashe

a    True
b    True
c    True
d    True
e    True
dtype: bool

In [72]:
df[(df['w']>0 ) & (df['y']>1)]

    w   x   y   z
b   6 -29  88 -80
d  16  -1   3  51

In [74]:
df.reset_index() #ye sotun jadid be name index dorost mikone

  index   w   x   y   z
0     a   2  79  -8 -86
1     b   6 -29  88 -80
2     c   2  21 -26 -13
3     d  16  -1   3  51
4     e  30  49 -48 -99

In [80]:
new_ind = ['CA','NY','WY','OR','CO']#yek sotun be name states ezafe mikonim
df['states'] = new_ind
df

         w   x   y   z states
states
CA       2  79  -8 -86     CA
NY       6 -29  88 -80     NY
WY       2  21 -26 -13     WY
OR      16  -1   3  51     OR
CO      30  49 -48 -99     CO

In [81]:
df = df.set_index('states') #states ro index mikone
#index dg column nist!!!!!
df

         w   x   y   z
states
CA       2  79  -8 -86
NY       6 -29  88 -80
WY       2  21 -26 -13
OR      16  -1   3  51
CO      30  49 -48 -99

In [82]:
df.describe() #tozihate kameli mide raje b data

              w          x          y          z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   w       5 non-null      int64
 1   x       5 non-null      int64
 2   y       5 non-null      int64
 3   z       5 non-null      int64
dtypes: int64(4)
memory usage: 200.0+ bytes

In [9]:
df = pd.DataFrame({'A':[1,2,np.nan,4],'B':[5,np.nan,np.nan,8],'C':[10,20,30,40]})

In [7]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [12]:
df.dropna(axis=1,thresh=2) #agar axes tain nakonim b tore default row ro mindaze 
#threshold yani ta chanta dorost bashan eshkal nadare, age 3 bezarim yani age kamtar az 3ta
#dorost bud bendaz bere un sotun ro
#masalan age thereshold 4 bud yani hadaghal 4 ta dorost bayad bashe

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [13]:
df.fillna(value='FILL VALUE')#value ro mizare be jaye nan va jalebesh ine k kole data ro tabdil 
#mikone masalan be string ya age adad bezarim be float

            A           B   C
0           1           5  10
1           2  FILL VALUE  20
2  FILL VALUE  FILL VALUE  30
3           4           8  40

In [14]:
df['A'].fillna(value = 0)#faghat ye sotun ro taghyir mide

0    1.0
1    2.0
2    0.0
3    4.0
Name: A, dtype: float64

In [18]:
df['B'].fillna(value = df['B'].mean())
#miad nan ro ba mean un sotun por mikone

0    5.0
1    6.5
2    6.5
3    8.0
Name: B, dtype: float64

In [19]:
df.fillna(df.mean())#hame sotun haro ba miangin por mikone

          A    B   C
0  1.000000  5.0  10
1  2.000000  6.5  20
2  2.333333  6.5  30
3  4.000000  8.0  40

In [20]:
df = pd.read_csv('./example_files/Universities.csv') #khundan file

In [24]:
df.head()

,Sector,University,Year,Completions,Geography
0,"Private for-profit, 2-year",Pima Medical Institute-Las Vegas,2016,591,Nevada
1,"Private for-profit, less-than 2-year",Healthcare Preparatory Institute,2016,28,Nevada
2,"Private for-profit, less-than 2-year",Milan Institute-Las Vegas,2016,408,Nevada
3,"Private for-profit, less-than 2-year",Utah College of Massage Therapy-Vegas,2016,240,Nevada
4,"Public, 4-year or above",Western Nevada College,2016,960,Nevada

In [29]:
df.groupby('Year').mean()

      Completions
Year
2012   535.078947
2013   526.150000
2014   588.809524
2015   597.250000
2016   609.860465

count	Number of non-null observations
sum 	Sum of values
mean	Mean of values
mad 	Mean absolute deviation
median	Arithmetic median of values
min	    Minimum
max	    Maximum
mode	Mode
abs	    Absolute Value
prod	Product of values
std 	Unbiased standard deviation
var 	Unbiased variance
sem	    Unbiased standard error of the mean
skew	Unbiased skewness (3rd moment)
kurt	Unbiased kurtosis (4th moment)
quantile	Sample quantile (value at %)
cumsum	Cumulative sum
cumprod	Cumulative product
cummax	Cumulative maximum
cummin	Cumulative minimum

In [38]:
df.groupby('Year').sum().sort_index(ascending = False)#sort mikone bar asase index

      Completions
Year
2016        26224
2015        26279
2014        24730
2013        21046
2012        20333

In [39]:
df.groupby(['Year','Sector']).sum()#bar asase year o sector taghsim mikone

                                              Completions
Year Sector
2012 Private for-profit, 2-year                      3072
     Private for-profit, 4-year or above              632
     Private for-profit, less-than 2-year            1327
     Private not-for-profit, 2-year                   665
     Private not-for-profit, 4-year or above         1059
     Public, 2-year                                  1170
     Public, 4-year or above                        12408
2013 Private for-profit, 2-year                      3053
     Private for-profit, 4-year or above              775
     Private for-profit, less-than 2-year            1281
     Private not-for-profit, 2-year                   471
     Private not-for-profit, 4-year or above         1016
     Public, 2-year                                  1633
     Public, 4-year or above                        12817
2014 Private for-profit, 2-year                      2957
     Private for-profit, 4-year or above             1506
     Private for-profit, less-than 2-year            1328
     Private not-for-profit, 2-year                   449
     Private not-for-profit, 4-year or above         1042
     Public, 2-year                                  2286
     Public, 4-year or above                        15162
2015 Private for-profit, 2-year                      3280
     Private for-profit, 4-year or above             1306
     Private for-profit, less-than 2-year            1629
     Private not-for-profit, 2-year                   425
     Private not-for-profit, 4-year or above         1228
     Public, 2-year                                  2355
     Public, 4-year or above                        16056
2016 Private for-profit, 2-year                      3286
     Private for-profit, 4-year or above              748
     Private for-profit, less-than 2-year            1552
     Private not-for-profit, 2-year                   322
     Private not-for-profit, 4-year or above         1208
     Public, 2-year                                  2431
     Public, 4-year or above                        16677

In [41]:
df.groupby('Year').describe().transpose()#moratab mikone

Year                      2012         2013         2014         2015  \
Completions count    38.000000    40.000000    42.000000    44.000000
            mean    535.078947   526.150000   588.809524   597.250000
            std    1036.433239  1040.474782  1150.355857  1183.371791
            min      13.000000     0.000000     0.000000     0.000000
            25%     114.250000    98.500000   104.500000    87.750000
            50%     229.500000   189.000000   203.500000   191.000000
            75%     420.500000   413.000000   371.750000   405.750000
            max    5388.000000  5278.000000  5093.000000  5335.000000

Year                      2016
Completions count    43.000000
            mean    609.860465
            std    1235.952796
            min       0.000000
            25%      90.000000
            50%     208.000000
            75%     414.000000
            max    5367.000000

In [43]:
df_one = pd.DataFrame({'k1':['A','A','B','B','C','C'],
                      'col1':[100,200,300,300,400,500],
                      'col2':['NY','CA','WA','WA','AK','NV']})
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [45]:
df_one['col2'].unique() #mige tu un column chi darim yki az har kodum

array(['NY', 'CA', 'WA', 'AK', 'NV'], dtype=object)

In [47]:
df_one['k1'].nunique()#tedade azaye uniq ro mige

3

In [48]:
df_one['col2'].value_counts() #mige chantast

WA    2
CA    1
NV    1
AK    1
NY    1
Name: col2, dtype: int64

In [52]:
df_one.drop_duplicates()#yki az har no ro negah midare

  k1  col1 col2   NEW
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NV  5000

In [51]:
df_one['NEW'] = df_one['col1'] * 10
df_one#ye sotun ezafe mikone

  k1  col1 col2   NEW
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
3  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NV  5000

In [54]:
def grab_first_letter(state):
    return state[0]
grab_first_letter('NY')

'N'

In [60]:
df_one['first letter']=df_one['col2'].apply(grab_first_letter)
df_one#tabei ro tarif kardim ke harfe avale col2 ro bde va ruye data apply kardim

  k1  col1 col2   NEW first letter
0  A   100   NY  1000            N
1  A   200   CA  2000            C
2  B   300   WA  3000            W
3  B   300   WA  3000            W
4  C   400   AK  4000            A
5  C   500   NV  5000            N

In [61]:
def complex_letter(state):
    if state[0] == 'W':
        return "Washington"
    else:
        return "Error"

In [62]:
df_one['col2'].apply(complex_letter)

0         Error
1         Error
2    Washington
3    Washington
4         Error
5         Error
Name: col2, dtype: object

In [63]:
df_one['k1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: k1, dtype: object

In [65]:
my_map = {"A":1,"B":2,"C":3}
df_one['num'] = df_one['k1'].map(my_map)
df_one#ba map, key haro check mikone va value ro mizare bejaye sotune jadid

  k1  col1 col2   NEW first letter  num
0  A   100   NY  1000            N    1
1  A   200   CA  2000            C    1
2  B   300   WA  3000            W    2
3  B   300   WA  3000            W    2
4  C   400   AK  4000            A    3
5  C   500   NV  5000            N    3

In [70]:
df_one['col1'].min()#min ya max ro mide

500

In [72]:
df_one['col1'].idxmin()#id min ya max ro mide

0

In [74]:
df_one.columns = ['C1','C2','C3','C4','C5','C6']#sotun haro mide va mishe esmashunam avaz ka
df_one

  C1   C2  C3    C4 C5  C6
0  A  100  NY  1000  N   1
1  A  200  CA  2000  C   1
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
4  C  400  AK  4000  A   3
5  C  500  NV  5000  N   3

In [75]:
df_one.sort_values('C3',ascending=False)#sort bar asase c3 va descending

  C1   C2  C3    C4 C5  C6
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
0  A  100  NY  1000  N   1
5  C  500  NV  5000  N   3
1  A  200  CA  2000  C   1
4  C  400  AK  4000  A   3

In [76]:
features = pd.DataFrame({'A':[100,200,300,400,500],
                      'B':[12,13,14,15,16]})
predictions = pd.DataFrame({'pred':[0,1,1,0,1]})

In [77]:
features

     A   B
0  100  12
1  200  13
2  300  14
3  400  15
4  500  16

In [78]:
predictions

   pred
0     0
1     1
2     1
3     0
4     1

In [81]:
pd.concat([features,predictions],axis=1)#2 data ro ba ham ezafe mikone
#be surat default axis ruye 0 yani row hast

     A   B  pred
0  100  12     0
1  200  13     1
2  300  14     1
3  400  15     0
4  500  16     1

In [87]:
df_one['C1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: C1, dtype: object

In [88]:
pd.get_dummies(df_one['C1'])#age tu har radif az una dashte bashe(masalan A) 1 vagarna 0

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1

In [91]:
df = pd.read_csv('./example_files/example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [92]:
pwd#file path ro mide be ma

'/home/masteropencv/1Python exercises/Tensorflow keras'

In [93]:
ls #list ro mide

example_files/  Numpy-Exercises.ipynb*  Numpy.ipynb  Pandas.ipynb

In [98]:
df.to_csv('output.csv',index=True)#save mikone va index age True bashe ye index jadid miare

In [96]:
pd.read_csv('output.csv')#index = false

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [99]:
pd.read_csv('output.csv')#index = true

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [100]:
#khundan az site vaghti table daran
tables = pd.read_html('https://www.sigmaaldrich.com/technical-documents/articles/biology/periodic-table-of-elements-names.html')

In [112]:
tables[1]

    Element Name Symbol  Atomic Number  Electronegativity ()
0       Actinium     Ac             89                   1.10
1       Aluminum     Al             13                   1.61
2      Americium     Am             95                   1.30
3       Antimony     Sb             51                   2.05
4          Argon     Ar             18                    NaN
..           ...    ...            ...                    ...
113        Xenon     Xe             54                   2.60
114    Ytterbium     Yb             70                    NaN
115      Yttrium      Y             39                   1.22
116         Zinc     Zn             30                   1.65
117    Zirconium     Zr             40                   1.33

[118 rows x 4 columns]